InfoCountryConfigs/src/main/synapse-config/sequences/GetPhoneSequence.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="GetPhoneSequence" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <payloadFactory media-type="xml">
        <format>
            <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
                <soapenv:Header/>
                <soapenv:Body>
                    <web:CountryIntPhoneCode>
                        <web:sCountryISOCode>$1</web:sCountryISOCode>
                    </web:CountryIntPhoneCode>
                </soapenv:Body>
            </soapenv:Envelope>
        </format>
        <args>
            <arg evaluator="xml" expression="$ctx:isocode"/>
        </args>
    </payloadFactory>
    <call>
        <endpoint key="CountryEndPoint"/>
    </call>
    <log level="full"/>
    <xslt key="CleanNameSpaceLocalEntry"/>
    <log/>
</sequence>
